#### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

1.read_csv:read_csv: This function is used to read data from a CSV (Comma-Separated Values) file and create a DataFrame.

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

2.head: It is used to display the first few rows of a DataFrame to quickly inspect the data.

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

3.describe: This function provides summary statistics of the DataFrame's numerical columns, including count, mean, standard deviation, minimum, and maximum.

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

4.dtypes:This function is used to display the data types of each column in a DataFrame. It provides information about the data type of each element in the DataFrame.

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

5.The columns attribute in Pandas is used to retrieve the column labels (column names) of a DataFrame. It returns a list of the column names

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
data = {"A":[10,20,30] , 
       "B":[40,50,60] , 
       "C":[70,80,90]}
pd.DataFrame(data)

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [8]:
def reindex(dataframe):
    d1 = pd.DataFrame(dataframe , index = (range(1,len(dataframe)*2,2)))
    return d1

In [9]:
reindex(data)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [10]:
data = {"A":[10,20,30,45,75,34,67,64] , 
       "B":[40,50,60,34,55,67,87,66] , 
       "C":[70,80,90,22,11,98,32,34] , 
       "Values":[11,22,33,44,55,66,77,88]}
df = pd.DataFrame(data)

In [11]:
df

    A   B   C  Values
0  10  40  70      11
1  20  50  80      22
2  30  60  90      33
3  45  34  22      44
4  75  55  11      55
5  34  67  98      66
6  67  87  32      77
7  64  66  34      88

In [12]:
def sum_first_three(dataframe):
    total=dataframe.loc[0:2,["Values"]].sum()
    print("The sum of first three rows of Column" ,total)

In [13]:
sum_first_three(df)

The sum of first three rows of Column Values    66
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [14]:
data = {"Text":["Niraj Shinde" , "pwskills" , "data science masters"]}

df = pd.DataFrame(data)

def count_words(dataframe):
    dataframe["Word_Count"] = dataframe["Text"].apply(lambda x:len(x.split()))
    return dataframe
    
count_words(df)

                   Text  Word_Count
0          Niraj Shinde           2
1              pwskills           1
2  data science masters           3

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size:
DataFrame.size returns the total number of elements in the DataFrame. This means it returns the product of the number of rows and the number of columns. In other words, it gives you the total count of cells in the DataFrame.

In [15]:
df = pd.DataFrame({'A':[1,2,3] , 'B':[4,5,6]})

In [16]:
df.size

6

DataFrame.shape:
DataFrame.shape returns a tuple that contains two elements: the number of rows and the number of columns in the DataFrame. It provides the shape or dimensions of the DataFrame.

In [17]:
df = pd.DataFrame({'A':[1,2,3] , 'B':[4,5,6]})
shape = df.shape

In [18]:
shape

(3, 2)

#### Q6. Which function of pandas do we use to read an excel file?

In pandas, you can use the pd.read_excel() function to read data from an Excel file. This function allows you to read data from an Excel file (both .xls and .xlsx formats) and create a DataFrame from the data.

excel_file = 'your_file.xlsx'

df = pd.read_excel(excel_file)

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email  addresses in the format 'username@domain.com'. Write a Python function that creates a new column'Username' in df that contains only the username part of each email address.

In [19]:
data = {"Email" : ["user1@gmail.com" , "user2@gmail.com" , "user3@gmail.com" , "user4@gmail.com" , "user5@gmail.com"]}
df = pd.DataFrame(data)

def extract_username(dataframe):
    username_domain = dataframe["Email"].str.split("@" , expand = True)
    dataframe["Username"] = username_domain[0]
    
    return dataframe

extract_username(df)

             Email Username
0  user1@gmail.com    user1
1  user2@gmail.com    user2
2  user3@gmail.com    user3
3  user4@gmail.com    user4
4  user5@gmail.com    user5

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [20]:
data = {"A" : [3,8,6,2,9] , 
       "B" : [5,2,9,3,1] , 
       "C" : [1,7,4,5,2]}
df = pd.DataFrame(data)

def sel_cols(dataframe):
    condition = (dataframe["A"] > 5) & (dataframe["B"] < 10)
    selected_df = dataframe[condition]
    
    return selected_df

sel_cols(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [23]:
data = {"Values":[4,65,443,66,456,4356,64]}
df = pd.DataFrame(data)

def m_m_m(dataframe):
    dataframe["Mean"] = dataframe["Values"].mean()
    dataframe["Median"] = dataframe["Values"].median()
    dataframe["Standard Deviation"] = dataframe["Values"].std()
    
    return dataframe

m_m_m(df)

   Values        Mean  Median  Standard Deviation
0       4  779.142857    66.0         1588.614116
1      65  779.142857    66.0         1588.614116
2     443  779.142857    66.0         1588.614116
3      66  779.142857    66.0         1588.614116
4     456  779.142857    66.0         1588.614116
5    4356  779.142857    66.0         1588.614116
6      64  779.142857    66.0         1588.614116

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [2]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Date': ['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04', '2023-11-05', '2023-11-06', '2023-11-07', '2023-11-08'],
    'Sales': [10, 15, 20, 25, 18, 30, 22, 27]
}

df = pd.DataFrame(data)

# Call the function to add the moving average column
df = add_moving_average(df)

# Print the resulting DataFrame
print(df)


def add_moving_average(df, window_size=7):
    # Make sure the DataFrame is sorted by date
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values(by='Date').reset_index(drop=True)

    # Calculate the moving average using a rolling window
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean()

    return df

# Example usage:
# Assuming df is your DataFrame with 'Sales' and 'Date' columns
# df = add_moving_average(df)

        Date  Sales  MovingAverage
0 2023-11-01     10      10.000000
1 2023-11-02     15      12.500000
2 2023-11-03     20      15.000000
3 2023-11-04     25      17.500000
4 2023-11-05     18      17.600000
5 2023-11-06     30      19.666667
6 2023-11-07     22      20.000000
7 2023-11-08     27      22.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [24]:
data = {"Date":["2023-01-01" , "2023-01-02" , "2023-01-03" , "2023-01-04" , "2023-01-05"]}
df = pd.DataFrame(data)

In [25]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [42]:
def get_date(dataframe):
    dataframe["Date"] = pd.to_datetime(dataframe["Date"])
    dataframe["Weekday"] = dataframe["Date"].dt.day_name()
    return dataframe

In [43]:
get_date(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [3]:
data = {"Date" : ["2023-01-06" , "2023-01-08" , "2023-01-17" , "2023-02-06" , "2023-03-18" , "2023-11-29" , "2023-01-26"]}
df = pd.DataFrame(data)

In [4]:
df

         Date
0  2023-01-06
1  2023-01-08
2  2023-01-17
3  2023-02-06
4  2023-03-18
5  2023-11-29
6  2023-01-26

In [5]:
def get_date_range(dataframe):
    start_date = "2023-01-01"
    end_date = "2023-01-31"
    
    mask = (dataframe["Date"] > start_date) & (dataframe["Date"] <= end_date)
    dataframe = dataframe.loc[mask]
    
    return dataframe

In [6]:
get_date_range(df)

         Date
0  2023-01-06
1  2023-01-08
2  2023-01-17
6  2023-01-26

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Need to import the below library:

import pandas as pd